{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import torch\n",
    "import torch.nn as nn\n",
    "import torch.nn.functional as F\n",
    "import numpy as np\n",
    "import torchvision\n",
    "from torchvision import transforms\n",
    "from torchvision.datasets import ImageFolder\n",
    "import math\n",
    "from torch.utils.data import Dataset, DataLoader\n",
    "from sklearn import datasets\n",
    "import matplotlib.pyplot as plt\n",
    "import matplotlib as mpl\n",
    "from sklearn.preprocessing import StandardScaler#para escalar caracteristicas\n",
    "from sklearn.model_selection import train_test_split # separar mas facil la data de train y test\n",
    "import pandas as pd\n",
    "from sklearn.utils import shuffle\n",
    "from ast import literal_eval\n",
    "import time\n",
    "import sys\n",
    "import os\n",
    "from scipy.signal import convolve2d\n",
    "from functions.auxiliares import PaddingSameSize, MatrixFormat_To_Vector, RemoveOversizedMatrix, StandardSize_Padding, CNN_Features_Format, batch_format, KernelSize, StandardSize_InitialConvolution, StandardSize\n",
    "import ast"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Index(['id', 'query', 'time', 'assign', 'bgp', 'distinct', 'extend', 'filter',\n",
       "       'filter_bound', 'filter_contains', 'filter_eq', 'filter_exists',\n",
       "       'filter_ge', 'filter_gt', 'filter_isBlank', 'filter_isIRI',\n",
       "       'filter_isLiteral', 'filter_lang', 'filter_langMatches', 'filter_le',\n",
       "       'filter_lt', 'filter_ne', 'filter_not', 'filter_notexists', 'filter_or',\n",
       "       'filter_regex', 'filter_sameTerm', 'filter_str', 'filter_strends',\n",
       "       'filter_strstarts', 'filter_subtract', 'graph', 'group', 'has_slice',\n",
       "       'join', 'json_cardinality', 'leftjoin', 'max_slice_limit',\n",
       "       'max_slice_start', 'minus', 'multi', 'notoneof', 'order', 'path*',\n",
       "       'path+', 'path?', 'pathN*', 'pathN+', 'pcs0', 'pcs1', 'pcs10', 'pcs11',\n",
       "       'pcs12', 'pcs13', 'pcs14', 'pcs15', 'pcs16', 'pcs17', 'pcs18', 'pcs19',\n",
       "       'pcs2', 'pcs20', 'pcs21', 'pcs22', 'pcs23', 'pcs24', 'pcs3', 'pcs4',\n",
       "       'pcs5', 'pcs6', 'pcs7', 'pcs8', 'pcs9', 'project', 'reduced',\n",
       "       'sequence', 'slice', 'tolist', 'top', 'tree_tdb', 'trees', 'treesize',\n",
       "       'triple', 'union'],\n",
       "      dtype='object')"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_raw = pd.read_csv('D:/.Memoria/Test/Datasets/ds_trainval_pred_filtered.csv', delimiter=\"ᶶ\", engine='python', encoding='utf-8')\n",
    "\n",
    "df_raw.columns"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "def p_lst(lst):\n",
    "    print(\"+++++++++++++++++++++++TOTAL+++++++++++++++++++++++++\")\n",
    "    print(len(lst))\n",
    "    print(\"\")\n",
    "    for x in lst:\n",
    "        print(\"++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\")\n",
    "        print(\"+++++++++++++++++++++++++queries2_\"+str(x)+\"++++++++++++++++++++++++++++++++++++++\")\n",
    "        print(\"++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\")\n",
    "        print(\"-------triple-------\")\n",
    "        print(df_raw['triple'][x])\n",
    "        print(\"-------bgp----------\")\n",
    "        print(df_raw['bgp'][x])\n",
    "        print(\"------unions---------\")\n",
    "        print(df_raw['query'][x].count('UNION'))\n",
    "        print(\"-----optionals--------\")\n",
    "        print(df_raw['query'][x].count('OPTIONAL'))\n",
    "        print(\"-----selects------\")\n",
    "        print(df_raw['query'][x].count('SELECT'))\n",
    "        print(\"------query--------\")\n",
    "        print(df_raw['query'][x])\n",
    "        print(\"------trees---------\")\n",
    "        print(df_raw['trees'][x])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "False"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import unicodedata as ud\n",
    "\n",
    "latin_letters= {}\n",
    "\n",
    "def is_latin(uchr):\n",
    "    try: return latin_letters[uchr]\n",
    "    except KeyError:\n",
    "         return latin_letters.setdefault(uchr, 'LATIN' in ud.name(uchr))\n",
    "def only_roman_chars(unistr):\n",
    "    return all(is_latin(uchr)\n",
    "           for uchr in unistr\n",
    "           if uchr.isalpha())\n",
    "\n",
    "only_roman_chars(u\"ελληνικά means greek\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+++++++++++++++++++++++TOTAL+++++++++++++++++++++++++\n",
      "35\n",
      "\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_1215++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "1.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P3906>  \"שאנן שיא\" } \n",
      "------trees---------\n",
      "[\"VAR_URI_LITERALᶲhttp://www.wikidata.org/prop/direct/P3906\"]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_1920++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "1.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  * WHERE   { ?var1  ?var2  \"Тубероза\"@en } LIMIT   100 \n",
      "------trees---------\n",
      "[\"VAR_VAR_LITERALᶲNONE\"]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_2119++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "1.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  * WHERE   { ?var1  <http://schema.org/description>  \"ភាសាខ្មែរ\"@km } \n",
      "------trees---------\n",
      "[\"VAR_URI_LITERALᶲhttp://schema.org/description\"]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_2806++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "1.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 ?var1Label WHERE   { ?var1  ?var2Label  \"1박2일\"@ko } LIMIT   10 \n",
      "------trees---------\n",
      "[\"VAR_VAR_LITERALᶲNONE\"]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_3803++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "1.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P3906>  \"קשר הדבש\" } \n",
      "------trees---------\n",
      "[\"VAR_URI_LITERALᶲhttp://www.wikidata.org/prop/direct/P3906\"]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_3970++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "1.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P3906>  \"בוכה בגשם\" } \n",
      "------trees---------\n",
      "[\"VAR_URI_LITERALᶲhttp://www.wikidata.org/prop/direct/P3906\"]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_5376++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "2.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  * WHERE   { ?var1  <http://schema.org/name>  \"اليمن\"@ar ;            ?var2                 ?var3   } \n",
      "------trees---------\n",
      "[ \"JOINᶲhttp://schema.org/name\" ,   [ \"VAR_URI_LITERALᶲhttp://schema.org/name\" ] ,   [ \"VAR_VAR_VARᶲNONE\" ] ] \n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_6510++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "1.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  * WHERE   { ?var1  ?var2  \"тубероза\"@ru } LIMIT   100 \n",
      "------trees---------\n",
      "[\"VAR_VAR_LITERALᶲNONE\"]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_9894++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "1.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P3906>  \"עור\" } \n",
      "------trees---------\n",
      "[\"VAR_URI_LITERALᶲhttp://www.wikidata.org/prop/direct/P3906\"]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_10538++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "1.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P3906>  \"קזבלן\" } \n",
      "------trees---------\n",
      "[\"VAR_URI_LITERALᶲhttp://www.wikidata.org/prop/direct/P3906\"]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_10553++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "1.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  * WHERE   { ?var1  ?var2  \"Тубероза\"@ru } LIMIT   100 \n",
      "------trees---------\n",
      "[\"VAR_VAR_LITERALᶲNONE\"]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_11432++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "1.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  * WHERE   { ?var1  ?var2  \"батько\"@ru } LIMIT   100 \n",
      "------trees---------\n",
      "[\"VAR_VAR_LITERALᶲNONE\"]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_12015++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "2.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  * WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q4167410> ;            <http://schema.org/description>  \"ན་མ\"@bo   } \n",
      "------trees---------\n",
      "[ \"JOINᶲhttp://www.wikidata.org/prop/direct/P31ᶲhttp://schema.org/description\" ,   [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\" ] ,   [ \"VAR_URI_LITERALᶲhttp://schema.org/description\" ] ] \n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_12050++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "3.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 ?var1Label ?var2 WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q515> ;            ?var1Label            \"Москва\"@ru ;            <http://www.wikidata.org/prop/direct/P625>  ?var2   } ORDER BY ASC(?var1Label) \n",
      "------trees---------\n",
      "[ \"JOINᶲhttp://www.wikidata.org/prop/direct/P31ᶲhttp://www.wikidata.org/prop/direct/P625\" ,   [ \"JOINᶲhttp://www.wikidata.org/prop/direct/P31ᶲhttp://www.wikidata.org/prop/direct/P625\" ,     [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\" ] ,     [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P625\" ]   ] ,   [ \"VAR_VAR_LITERALᶲNONE\" ] ] \n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_12167++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "1.0\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 ?var1Label ?var2 WHERE   { ?var1 <http://www.wikidata.org/prop/direct/P31>/(<http://www.wikidata.org/prop/direct/P279>)* <http://www.wikidata.org/entity/Q515> .     ?var1  ?var1Label  \"Москва\"@ru   } ORDER BY ASC(?var1Label) \n",
      "------trees---------\n",
      "[\"JOIN\", [\"JOIN\", [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P279\"], [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P31\"]], [\"VAR_VAR_LITERALᶲNONE\"]]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_12244++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "2.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  * WHERE   { ?var1  ?var2Label  \"اليمن\"@ar ;            ?var3       ?var4   } \n",
      "------trees---------\n",
      "[ \"JOINᶲ\" ,   [ \"VAR_VAR_LITERALᶲNONE\" ] ,   [ \"VAR_VAR_VARᶲNONE\" ] ] \n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_12908++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "3.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT DISTINCT * WHERE { ?var1 ?var2Label \"박원순\"@ko . ?var1 <http://www.wikidata.org/prop/direct/P39> ?var3 . ?var3 ?var2Label ?var3Label . }\n",
      "------trees---------\n",
      "[ \"JOINᶲhttp://www.wikidata.org/prop/direct/P39\" ,   [ \"JOINᶲhttp://www.wikidata.org/prop/direct/P39\" ,     [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P39\" ] ,     [ \"VAR_VAR_LITERALᶲNONE\" ]   ] ,   [ \"VAR_VAR_VARᶲNONE\" ] ] \n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_12998++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "3.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT DISTINCT ?var1 ?var2Label WHERE { ?var1 ?var3Label \"박원순\"@ko . ?var1 <http://www.wikidata.org/prop/direct/P39> ?var2 . ?var2 ?var3Label ?var2Label . }\n",
      "------trees---------\n",
      "[ \"JOINᶲhttp://www.wikidata.org/prop/direct/P39\" ,   [ \"JOINᶲhttp://www.wikidata.org/prop/direct/P39\" ,     [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P39\" ] ,     [ \"VAR_VAR_LITERALᶲNONE\" ]   ] ,   [ \"VAR_VAR_VARᶲNONE\" ] ] \n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_13870++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "3.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT DISTINCT ?var1 ?var2Label ?var3Label WHERE { ?var1 ?var2Label \"박원순\"@ko . ?var1 <http://www.wikidata.org/prop/direct/P39> ?var3 . ?var3 ?var2Label ?var3Label . }\n",
      "------trees---------\n",
      "[ \"JOINᶲhttp://www.wikidata.org/prop/direct/P39\" ,   [ \"JOINᶲhttp://www.wikidata.org/prop/direct/P39\" ,     [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P39\" ] ,     [ \"VAR_VAR_LITERALᶲNONE\" ]   ] ,   [ \"VAR_VAR_VARᶲNONE\" ] ] \n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_13945++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "2.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 ?var1Label ?var2 WHERE   { ?var1 <http://www.wikidata.org/prop/direct/P31>/(<http://www.wikidata.org/prop/direct/P279>)* <http://www.wikidata.org/entity/Q515> .     ?var1  ?var1Label            \"Москва\"@ru ;            <http://www.wikidata.org/prop/direct/P625>  ?var2   } ORDER BY ASC(?var1Label) \n",
      "------trees---------\n",
      "[\"JOIN\", [\"JOIN\", [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P279\"], [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P31\"]], [ \"JOINᶲhttp://www.wikidata.org/prop/direct/P625\" ,   [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P625\" ] ,   [ \"VAR_VAR_LITERALᶲNONE\" ] ] ]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_14197++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "2.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 ?var1Label ?var2 WHERE   { ?var1 <http://www.wikidata.org/prop/direct/P31>/(<http://www.wikidata.org/prop/direct/P279>)* <http://www.wikidata.org/entity/Q515> .     ?var1  ?var1Label            \"Москва\"@ru ;            <http://www.wikidata.org/prop/direct/P625>  ?var2   } ORDER BY ASC(?var1Label) \n",
      "------trees---------\n",
      "[\"JOIN\", [\"JOIN\", [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P279\"], [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P31\"]], [ \"JOINᶲhttp://www.wikidata.org/prop/direct/P625\" ,   [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P625\" ] ,   [ \"VAR_VAR_LITERALᶲNONE\" ] ] ]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_14250++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "2.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  * WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q4167410> ;            <http://schema.org/description>  \"Катэгорыя\"@be-tarask   } \n",
      "------trees---------\n",
      "[ \"JOINᶲhttp://www.wikidata.org/prop/direct/P31ᶲhttp://schema.org/description\" ,   [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\" ] ,   [ \"VAR_URI_LITERALᶲhttp://schema.org/description\" ] ] \n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_14415++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "2.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  * WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q4167410> ;            <http://schema.org/description>  \"Катэгорыя\"@be-tarask   } \n",
      "------trees---------\n",
      "[ \"JOINᶲhttp://www.wikidata.org/prop/direct/P31ᶲhttp://schema.org/description\" ,   [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\" ] ,   [ \"VAR_URI_LITERALᶲhttp://schema.org/description\" ] ] \n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_14739++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "4.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 ?var1Label ?var2 WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q515> ;            ?var1Label            \"Москва\"@ru ;            ?var1Label            \"Омск\"@ru ;            <http://www.wikidata.org/prop/direct/P625>  ?var2   } ORDER BY ASC(?var1Label) \n",
      "------trees---------\n",
      "[ \"JOINᶲhttp://www.wikidata.org/prop/direct/P31ᶲhttp://www.wikidata.org/prop/direct/P625\" ,   [ \"JOINᶲhttp://www.wikidata.org/prop/direct/P31ᶲhttp://www.wikidata.org/prop/direct/P625\" ,     [ \"JOINᶲhttp://www.wikidata.org/prop/direct/P31ᶲhttp://www.wikidata.org/prop/direct/P625\" ,       [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\" ] ,       [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P625\" ]     ] ,     [ \"VAR_VAR_LITERALᶲNONE\" ]   ] ,   [ \"VAR_VAR_LITERALᶲNONE\" ] ] \n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+++++++++++++++++++++++++queries2_15067++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "4.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 ?var1Label ?var2 WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q515> ;            ?var1Label            \"Москва\"@ru ;            ?var1Label            \"Омск\"@ru ;            <http://www.wikidata.org/prop/direct/P625>  ?var2   } ORDER BY ASC(?var1Label) \n",
      "------trees---------\n",
      "[ \"JOINᶲhttp://www.wikidata.org/prop/direct/P31ᶲhttp://www.wikidata.org/prop/direct/P625\" ,   [ \"JOINᶲhttp://www.wikidata.org/prop/direct/P31ᶲhttp://www.wikidata.org/prop/direct/P625\" ,     [ \"JOINᶲhttp://www.wikidata.org/prop/direct/P31ᶲhttp://www.wikidata.org/prop/direct/P625\" ,       [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\" ] ,       [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P625\" ]     ] ,     [ \"VAR_VAR_LITERALᶲNONE\" ]   ] ,   [ \"VAR_VAR_LITERALᶲNONE\" ] ] \n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_15272++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "2.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  * WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q4167410> ;            <http://schema.org/description>  \"Катэгорыя\"@be-tarask   } \n",
      "------trees---------\n",
      "[ \"JOINᶲhttp://www.wikidata.org/prop/direct/P31ᶲhttp://schema.org/description\" ,   [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\" ] ,   [ \"VAR_URI_LITERALᶲhttp://schema.org/description\" ] ] \n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_15433++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "2.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT DISTINCT * WHERE { ?var1 ?var2Label \"박원순\"@ko . ?var1 <http://www.wikidata.org/prop/direct/P39> ?var3 . }\n",
      "------trees---------\n",
      "[ \"JOINᶲhttp://www.wikidata.org/prop/direct/P39\" ,   [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P39\" ] ,   [ \"VAR_VAR_LITERALᶲNONE\" ] ] \n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_18583++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "2.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  * WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q4167410> ;            <http://schema.org/description>  \"Вікіпэдыя\"@be-tarask   } \n",
      "------trees---------\n",
      "[ \"JOINᶲhttp://www.wikidata.org/prop/direct/P31ᶲhttp://schema.org/description\" ,   [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\" ] ,   [ \"VAR_URI_LITERALᶲhttp://schema.org/description\" ] ] \n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_18985++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "2.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  * WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q4167410> ;            <http://schema.org/description>  \"Вікіпэдыя\"@be-tarask   } \n",
      "------trees---------\n",
      "[ \"JOINᶲhttp://www.wikidata.org/prop/direct/P31ᶲhttp://schema.org/description\" ,   [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\" ] ,   [ \"VAR_URI_LITERALᶲhttp://schema.org/description\" ] ] \n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_23129++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "2.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  * WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q4167410> ;            <http://schema.org/description>  \"ޗެލެންޖް\"@dv   } \n",
      "------trees---------\n",
      "[ \"JOINᶲhttp://www.wikidata.org/prop/direct/P31ᶲhttp://schema.org/description\" ,   [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\" ] ,   [ \"VAR_URI_LITERALᶲhttp://schema.org/description\" ] ] \n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_23505++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "2.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  * WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q4167410> ;            <http://schema.org/description>  \"ޗެލެންޖް\"@dv   } \n",
      "------trees---------\n",
      "[ \"JOINᶲhttp://www.wikidata.org/prop/direct/P31ᶲhttp://schema.org/description\" ,   [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\" ] ,   [ \"VAR_URI_LITERALᶲhttp://schema.org/description\" ] ] \n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_23590++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "2.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  * WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q4167410> ;            <http://schema.org/description>  \"Категорії\"@uk   } \n",
      "------trees---------\n",
      "[ \"JOINᶲhttp://www.wikidata.org/prop/direct/P31ᶲhttp://schema.org/description\" ,   [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\" ] ,   [ \"VAR_URI_LITERALᶲhttp://schema.org/description\" ] ] \n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_23843++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "2.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  * WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q4167410> ;            <http://schema.org/description>  \"Категорії\"@uk   } \n",
      "------trees---------\n",
      "[ \"JOINᶲhttp://www.wikidata.org/prop/direct/P31ᶲhttp://schema.org/description\" ,   [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\" ] ,   [ \"VAR_URI_LITERALᶲhttp://schema.org/description\" ] ] \n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_23848++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "2.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  * WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q4167410> ;            <http://schema.org/description>  \"ޗެލެންޖް\"@dv   } \n",
      "------trees---------\n",
      "[ \"JOINᶲhttp://www.wikidata.org/prop/direct/P31ᶲhttp://schema.org/description\" ,   [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\" ] ,   [ \"VAR_URI_LITERALᶲhttp://schema.org/description\" ] ] \n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_23936++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "2.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "------query--------\n",
      "SELECT  * WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q4167410> ;            <http://schema.org/description>  \"Категорії\"@uk   } \n",
      "------trees---------\n",
      "[ \"JOINᶲhttp://www.wikidata.org/prop/direct/P31ᶲhttp://schema.org/description\" ,   [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\" ] ,   [ \"VAR_URI_LITERALᶲhttp://schema.org/description\" ] ] \n"
     ]
    }
   ],
   "source": [
    "a = []\n",
    "for i in range(len(df_raw['bgp'])):\n",
    "    if 'LITERAL' in df_raw['trees'][i] \\\n",
    "    and not only_roman_chars(df_raw['query'][i]):\n",
    "        a.append(i)\n",
    "\n",
    "p_lst(a)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+++++++++++++++++++++++TOTAL+++++++++++++++++++++++++\n",
      "40\n",
      "\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_0++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "4.0\n",
      "-------bgp----------\n",
      "2.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "1\n",
      "-----selects------\n",
      "2\n",
      "------query--------\n",
      "SELECT  ?var1 ?var2 (SAMPLE(?var3) AS ?var4) WHERE   { { SELECT DISTINCT  ?var1 ?var2       WHERE         { ?var2  <http://www.wikidata.org/prop/statement/P355>  <http://www.wikidata.org/entity/Q15142> .           ?var1  <http://www.wikidata.org/prop/P355>  ?var2         }       LIMIT   101     }     OPTIONAL       { ?var2  ?var3                 ?var5 .         ?var6  <http://wikiba.se/ontology#qualifier>  ?var3       }   } GROUP BY ?var1 ?var2 \n",
      "------trees---------\n",
      "[\"LEFT_JOIN\" , [ \"JOINᶲhttp://www.wikidata.org/prop/statement/P355ᶲhttp://www.wikidata.org/prop/P355\" ,   [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/statement/P355\" ] ,   [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/P355\" ] ] , [ \"JOINᶲhttp://wikiba.se/ontology#qualifier\" ,   [ \"VAR_URI_VARᶲhttp://wikiba.se/ontology#qualifier\" ] ,   [ \"VAR_VAR_VARᶲNONE\" ] ] ]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_22++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "3.0\n",
      "-------bgp----------\n",
      "2.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "1\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 ?var2 WHERE   { ?var1  <http://www.wikidata.org/prop/P3982>  ?var2 .     ?var3  <http://schema.org/about>  ?var1     OPTIONAL       { ?var1  <http://schema.org/description>  ?var4         FILTER ( lang(?var4) = \"en,ro\" )       }   } \n",
      "------trees---------\n",
      "[\"LEFT_JOIN\" , [ \"JOINᶲhttp://www.wikidata.org/prop/P3982ᶲhttp://schema.org/about\" ,   [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/P3982\" ] ,   [ \"VAR_URI_VARᶲhttp://schema.org/about\" ] ] , [\"VAR_URI_VARᶲhttp://schema.org/description\"]]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_275++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "3.0\n",
      "-------bgp----------\n",
      "2.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "1\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 ?var2 WHERE   { <http://www.wikidata.org/entity/Q2661348>               <http://www.wikidata.org/prop/direct/P625>  ?var1     OPTIONAL       { <http://www.wikidata.org/entity/Q2661348>                   <http://www.wikidata.org/prop/direct/P131>  ?var3 .         ?var3     <http://www.wikidata.org/prop/direct/P625>  ?var2       }   } \n",
      "------trees---------\n",
      "[\"LEFT_JOIN\" , [\"URI_URI_VARᶲhttp://www.wikidata.org/prop/direct/P625\"] , [ \"JOINᶲhttp://www.wikidata.org/prop/direct/P131ᶲhttp://www.wikidata.org/prop/direct/P625\" ,   [ \"URI_URI_VARᶲhttp://www.wikidata.org/prop/direct/P131\" ] ,   [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P625\" ] ] ]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_457++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "2.0\n",
      "-------bgp----------\n",
      "2.0\n",
      "------unions---------\n",
      "1\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 WHERE   {   { ?var1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q864380> }     UNION       { <http://www.wikidata.org/entity/Q864380>                   <http://www.wikidata.org/prop/direct/P373>  ?var1       }   } LIMIT   1 \n",
      "------trees---------\n",
      "[\"LEFT_JOIN\" , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\"] , [\"URI_URI_VARᶲhttp://www.wikidata.org/prop/direct/P373\"]]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_556++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "1.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P3593>  \"63527\" } \n",
      "------trees---------\n",
      "[\"VAR_URI_LITERALᶲhttp://www.wikidata.org/prop/direct/P3593\"]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_666++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "2.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  * WHERE   { ?var1  <http://schema.org/about>  <http://www.wikidata.org/entity/Q5128413> ;            <http://schema.org/inLanguage>  ?var2   } \n",
      "------trees---------\n",
      "[ \"JOINᶲhttp://schema.org/inLanguageᶲhttp://schema.org/about\" ,   [ \"VAR_URI_VARᶲhttp://schema.org/inLanguage\" ] ,   [ \"VAR_URI_URIᶲhttp://schema.org/about\" ] ] \n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_766++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "2.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 WHERE   { <http://identifiers.org/wikipathways/WP2509_r89322>               <http://www.wikidata.org/prop/direct/P2410>  ?var1 ;               <http://www.wikidata.org/prop/direct/P703>  <http://www.wikidata.org/entity/Q15978631>   } \n",
      "------trees---------\n",
      "[ \"JOINᶲhttp://www.wikidata.org/prop/direct/P703ᶲhttp://www.wikidata.org/prop/direct/P2410\" ,   [ \"URI_URI_URIᶲhttp://www.wikidata.org/prop/direct/P703\" ] ,   [ \"URI_URI_VARᶲhttp://www.wikidata.org/prop/direct/P2410\" ] ] \n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_800++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "4.0\n",
      "-------bgp----------\n",
      "2.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "1\n",
      "-----selects------\n",
      "2\n",
      "------query--------\n",
      "SELECT  ?var1 ?var2 (SAMPLE(?var3) AS ?var4) WHERE   { { SELECT DISTINCT  ?var1 ?var2       WHERE         { ?var2  <http://www.wikidata.org/prop/statement/P460>  <http://www.wikidata.org/entity/Q60> .           ?var1  <http://www.wikidata.org/prop/P460>  ?var2         }       LIMIT   101     }     OPTIONAL       { ?var2  ?var3                 ?var5 .         ?var6  <http://wikiba.se/ontology#qualifier>  ?var3       }   } GROUP BY ?var1 ?var2 \n",
      "------trees---------\n",
      "[\"LEFT_JOIN\" , [ \"JOINᶲhttp://www.wikidata.org/prop/statement/P460ᶲhttp://www.wikidata.org/prop/P460\" ,   [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/statement/P460\" ] ,   [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/P460\" ] ] , [ \"JOINᶲhttp://wikiba.se/ontology#qualifier\" ,   [ \"VAR_URI_VARᶲhttp://wikiba.se/ontology#qualifier\" ] ,   [ \"VAR_VAR_VARᶲNONE\" ] ] ]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_998++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "1.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P279>  <http://www.wikidata.org/entity/Q126457> } \n",
      "------trees---------\n",
      "[\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P279\"]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_1248++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "4.0\n",
      "-------bgp----------\n",
      "2.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "1\n",
      "-----selects------\n",
      "2\n",
      "------query--------\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "SELECT  ?var1 ?var2 (SAMPLE(?var3) AS ?var4) WHERE   { { SELECT DISTINCT  ?var1 ?var2       WHERE         { ?var2  <http://www.wikidata.org/prop/statement/P136>  <http://www.wikidata.org/entity/Q5185279> .           ?var1  <http://www.wikidata.org/prop/P136>  ?var2         }       LIMIT   101     }     OPTIONAL       { ?var2  ?var3                 ?var5 .         ?var6  <http://wikiba.se/ontology#qualifier>  ?var3       }   } GROUP BY ?var1 ?var2 \n",
      "------trees---------\n",
      "[\"LEFT_JOIN\" , [ \"JOINᶲhttp://www.wikidata.org/prop/statement/P136ᶲhttp://www.wikidata.org/prop/P136\" ,   [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/statement/P136\" ] ,   [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/P136\" ] ] , [ \"JOINᶲhttp://wikiba.se/ontology#qualifier\" ,   [ \"VAR_URI_VARᶲhttp://wikiba.se/ontology#qualifier\" ] ,   [ \"VAR_VAR_VARᶲNONE\" ] ] ]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_2303++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "12.0\n",
      "-------bgp----------\n",
      "12.0\n",
      "------unions---------\n",
      "11\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT DISTINCT  ?var1 WHERE   {   { ?var1  <http://www.wikidata.org/prop/direct/P463>  <http://www.wikidata.org/entity/Q2267670> }     UNION       { ?var1  <http://www.wikidata.org/prop/direct/P39>  <http://www.wikidata.org/entity/Q2267670> }     UNION       { ?var1  <http://www.wikidata.org/prop/direct/P166>  <http://www.wikidata.org/entity/Q2267670> }     UNION       { ?var1  <http://www.wikidata.org/prop/direct/P106>  <http://www.wikidata.org/entity/Q2267670> }     UNION       { ?var1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q2267670> }     UNION       { ?var1  <http://www.wikidata.org/prop/direct/P102>  <http://www.wikidata.org/entity/Q2267670> }     UNION       { ?var1  <http://www.wikidata.org/prop/direct/P463>  <http://www.wikidata.org/entity/Q2056594> }     UNION       { ?var1  <http://www.wikidata.org/prop/direct/P39>  <http://www.wikidata.org/entity/Q2056594> }     UNION       { ?var1  <http://www.wikidata.org/prop/direct/P166>  <http://www.wikidata.org/entity/Q2056594> }     UNION       { ?var1  <http://www.wikidata.org/prop/direct/P106>  <http://www.wikidata.org/entity/Q2056594> }     UNION       { ?var1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q2056594> }     UNION       { ?var1  <http://www.wikidata.org/prop/direct/P102>  <http://www.wikidata.org/entity/Q2056594> }   } LIMIT   1000 \n",
      "------trees---------\n",
      "[\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P463\"] , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P39\"]] , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P166\"]] , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P106\"]] , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\"]] , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P102\"]] , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P463\"]] , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P39\"]] , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P166\"]] , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P106\"]] , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\"]] , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P102\"]]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_3222++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "4.0\n",
      "-------bgp----------\n",
      "2.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "1\n",
      "-----selects------\n",
      "2\n",
      "------query--------\n",
      "SELECT  ?var1 ?var2 (SAMPLE(?var3) AS ?var4) WHERE   { { SELECT DISTINCT  ?var1 ?var2       WHERE         { ?var2  <http://www.wikidata.org/prop/statement/P1343>  <http://www.wikidata.org/entity/Q571> .           ?var1  <http://www.wikidata.org/prop/P1343>  ?var2         }       LIMIT   101     }     OPTIONAL       { ?var2  ?var3                 ?var5 .         ?var6  <http://wikiba.se/ontology#qualifier>  ?var3       }   } GROUP BY ?var1 ?var2 \n",
      "------trees---------\n",
      "[\"LEFT_JOIN\" , [ \"JOINᶲhttp://www.wikidata.org/prop/statement/P1343ᶲhttp://www.wikidata.org/prop/P1343\" ,   [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/statement/P1343\" ] ,   [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/P1343\" ] ] , [ \"JOINᶲhttp://wikiba.se/ontology#qualifier\" ,   [ \"VAR_URI_VARᶲhttp://wikiba.se/ontology#qualifier\" ] ,   [ \"VAR_VAR_VARᶲNONE\" ] ] ]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_3599++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "5.0\n",
      "-------bgp----------\n",
      "5.0\n",
      "------unions---------\n",
      "3\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT DISTINCT  ?var1 WHERE   { ?var1  <http://www.wikidata.org/prop/P31>  ?var2       { ?var2  <http://www.wikidata.org/prop/statement/P31>  <http://www.wikidata.org/entity/Q6465> }     UNION       { ?var2  <http://www.wikidata.org/prop/statement/P31>  <http://www.wikidata.org/entity/Q202216> }     UNION       { ?var2  <http://www.wikidata.org/prop/statement/P31>  <http://www.wikidata.org/entity/Q719487> }     UNION       { ?var2  <http://www.wikidata.org/prop/statement/P31>  <http://www.wikidata.org/entity/Q3408484> }   } \n",
      "------trees---------\n",
      "[\"JOIN\", [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/P31\"], [\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/statement/P31\"] , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/statement/P31\"]] , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/statement/P31\"]] , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/statement/P31\"]]]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_4732++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "4.0\n",
      "-------bgp----------\n",
      "2.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "1\n",
      "-----selects------\n",
      "2\n",
      "------query--------\n",
      "SELECT  ?var1 ?var2 (SAMPLE(?var3) AS ?var4) WHERE   { { SELECT DISTINCT  ?var1 ?var2       WHERE         { ?var2  <http://www.wikidata.org/prop/statement/P159>  <http://www.wikidata.org/entity/Q2843> .           ?var1  <http://www.wikidata.org/prop/P159>  ?var2         }       LIMIT   101     }     OPTIONAL       { ?var2  ?var3                 ?var5 .         ?var6  <http://wikiba.se/ontology#qualifier>  ?var3       }   } GROUP BY ?var1 ?var2 \n",
      "------trees---------\n",
      "[\"LEFT_JOIN\" , [ \"JOINᶲhttp://www.wikidata.org/prop/statement/P159ᶲhttp://www.wikidata.org/prop/P159\" ,   [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/statement/P159\" ] ,   [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/P159\" ] ] , [ \"JOINᶲhttp://wikiba.se/ontology#qualifier\" ,   [ \"VAR_URI_VARᶲhttp://wikiba.se/ontology#qualifier\" ] ,   [ \"VAR_VAR_VARᶲNONE\" ] ] ]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_5095++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "3.0\n",
      "-------bgp----------\n",
      "3.0\n",
      "------unions---------\n",
      "1\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 (COUNT(DISTINCT ?var2) AS ?var3) WHERE   {   { ?var2  <http://www.wikidata.org/prop/direct/P119>  <http://www.wikidata.org/entity/Q3562646> }     UNION       { ?var2  <http://www.wikidata.org/prop/direct/P119>  <http://www.wikidata.org/entity/Q118967> }     BIND(year(?var4) AS ?var1)     ?var2  <http://www.wikidata.org/prop/direct/P570>  ?var4   } GROUP BY ?var1 ORDER BY ASC(?var1) \n",
      "------trees---------\n",
      "[\"JOIN\", [\"LEFT_JOIN\" , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P119\"] , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P119\"]], [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P570\"]]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+++++++++++++++++++++++++queries2_5429++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "3.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT DISTINCT  ?var1 ?var2 ?var3 WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q81672> ;            ?var3                 <http://www.wikidata.org/entity/Q60> ;            <http://www.wikidata.org/prop/direct/P625>  ?var2   } \n",
      "------trees---------\n",
      "[ \"JOINᶲhttp://www.wikidata.org/prop/direct/P31ᶲhttp://www.wikidata.org/prop/direct/P625ᶲhttp://www.wikidata.org/entity/Q60\" ,   [ \"JOINᶲhttp://www.wikidata.org/prop/direct/P31ᶲhttp://www.wikidata.org/prop/direct/P625\" ,     [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\" ] ,     [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P625\" ]   ] ,   [ \"VAR_VAR_URIᶲhttp://www.wikidata.org/entity/Q60\" ] ] \n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_6985++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "1.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1Label WHERE   { ?var2  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/prop/direct/P1340> } \n",
      "------trees---------\n",
      "[\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\"]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_7788++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "1.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P2529>  \"228666\" } \n",
      "------trees---------\n",
      "[\"VAR_URI_LITERALᶲhttp://www.wikidata.org/prop/direct/P2529\"]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_8358++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "2.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT DISTINCT  * WHERE   { VALUES ?var1 { <http://www.wikidata.org/entity/Q416426> <http://www.wikidata.org/entity/Q417743> <http://www.wikidata.org/entity/Q418634> }     ?var1  <http://www.wikidata.org/prop/direct/P351>  ?var2 ;            <http://www.wikidata.org/prop/direct/P703>  <http://www.wikidata.org/entity/Q15978631>   } \n",
      "------trees---------\n",
      "[ \"JOINᶲhttp://www.wikidata.org/prop/direct/P703ᶲhttp://www.wikidata.org/prop/direct/P351\" ,   [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P703\" ] ,   [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P351\" ] ] \n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_8830++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "2.0\n",
      "-------bgp----------\n",
      "2.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "1\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 ?var2 ?var3 WHERE   { ?var2  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q39829>     OPTIONAL       { ?var2  <http://www.wikidata.org/prop/direct/P40>  ?var3 }   } \n",
      "------trees---------\n",
      "[\"LEFT_JOIN\" , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\"] , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P40\"]]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_8930++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "4.0\n",
      "-------bgp----------\n",
      "2.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "1\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 ?var2 ?var3 WHERE   { ?var4  <http://schema.org/isPartOf>  <https://sr.wiktionary.org/> ;            <http://schema.org/name>  ?var2 ;            <http://schema.org/about>  ?var1     OPTIONAL       { ?var1  <http://www.wikidata.org/prop/direct/P31>  ?var3 }   } \n",
      "------trees---------\n",
      "[\"LEFT_JOIN\" , [ \"JOINᶲhttp://schema.org/isPartOfᶲhttp://schema.org/nameᶲhttp://schema.org/about\" ,   [ \"JOINᶲhttp://schema.org/isPartOfᶲhttp://schema.org/name\" ,     [ \"VAR_URI_URIᶲhttp://schema.org/isPartOf\" ] ,     [ \"VAR_URI_VARᶲhttp://schema.org/name\" ]   ] ,   [ \"VAR_URI_VARᶲhttp://schema.org/about\" ] ] , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P31\"]]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_8932++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "3.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT DISTINCT  ?var1 ?var2 ?var3 WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q55488> ;            ?var3                 <http://www.wikidata.org/entity/Q145> ;            <http://www.wikidata.org/prop/direct/P625>  ?var2   } LIMIT   100 \n",
      "------trees---------\n",
      "[ \"JOINᶲhttp://www.wikidata.org/prop/direct/P31ᶲhttp://www.wikidata.org/prop/direct/P625ᶲhttp://www.wikidata.org/entity/Q145\" ,   [ \"JOINᶲhttp://www.wikidata.org/prop/direct/P31ᶲhttp://www.wikidata.org/prop/direct/P625\" ,     [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\" ] ,     [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P625\" ]   ] ,   [ \"VAR_VAR_URIᶲhttp://www.wikidata.org/entity/Q145\" ] ] \n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_9568++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "1.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P480>  \"273113\" } \n",
      "------trees---------\n",
      "[\"VAR_URI_LITERALᶲhttp://www.wikidata.org/prop/direct/P480\"]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_10757++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "4.0\n",
      "-------bgp----------\n",
      "2.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "1\n",
      "-----selects------\n",
      "2\n",
      "------query--------\n",
      "SELECT  ?var1 ?var2 (SAMPLE(?var3) AS ?var4) WHERE   { { SELECT DISTINCT  ?var1 ?var2       WHERE         { ?var2  <http://www.wikidata.org/prop/statement/P1574>  <http://www.wikidata.org/entity/Q11424> .           ?var1  <http://www.wikidata.org/prop/P1574>  ?var2         }       LIMIT   101     }     OPTIONAL       { ?var2  ?var3                 ?var5 .         ?var6  <http://wikiba.se/ontology#qualifier>  ?var3       }   } GROUP BY ?var1 ?var2 \n",
      "------trees---------\n",
      "[\"LEFT_JOIN\" , [ \"JOINᶲhttp://www.wikidata.org/prop/statement/P1574ᶲhttp://www.wikidata.org/prop/P1574\" ,   [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/statement/P1574\" ] ,   [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/P1574\" ] ] , [ \"JOINᶲhttp://wikiba.se/ontology#qualifier\" ,   [ \"VAR_URI_VARᶲhttp://wikiba.se/ontology#qualifier\" ] ,   [ \"VAR_VAR_VARᶲNONE\" ] ] ]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_10969++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "16.0\n",
      "-------bgp----------\n",
      "12.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "11\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "SELECT  ?var1 ?var1Label ?var2 ?var3 ?var4 ?var5 ?var6 ?var7 ?var8 ?var9 ?var10 ?var11 ?var12 ?var13 ?var14 ?var15 ?var16 WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q179700> ;            <http://www.wikidata.org/prop/direct/P571>  ?var2 ;            <http://www.wikidata.org/prop/direct/P186>  ?var3 ;            <http://www.wikidata.org/prop/direct/P18>  ?var4 ;            <http://www.wikidata.org/prop/direct/P170>  ?var6     OPTIONAL       { ?var1  <http://www.wikidata.org/prop/direct/P10>  ?var5 }     OPTIONAL       { ?var1  <http://www.wikidata.org/prop/direct/P625>  ?var7 }     OPTIONAL       { ?var1  <http://www.wikidata.org/prop/direct/P276>  ?var8 }     OPTIONAL       { ?var1  <http://www.wikidata.org/prop/direct/P2048>  ?var9 }     OPTIONAL       { ?var1  <http://www.wikidata.org/prop/direct/P2049>  ?var10 }     OPTIONAL       { ?var1  <http://www.wikidata.org/prop/direct/P2067>  ?var11 }     OPTIONAL       { ?var1  <http://www.wikidata.org/prop/direct/P61>  ?var12 }     OPTIONAL       { ?var1  <http://www.wikidata.org/prop/direct/P2610>  ?var13 }     OPTIONAL       { ?var1  <http://www.wikidata.org/prop/direct/P180>  ?var14 }     OPTIONAL       { ?var1  <http://www.wikidata.org/prop/direct/P2913>  ?var15 }     OPTIONAL       { ?var1  <http://www.wikidata.org/prop/direct/P195>  ?var16 }   } LIMIT   100 \n",
      "------trees---------\n",
      "[\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [ \"JOINᶲhttp://www.wikidata.org/prop/direct/P31ᶲhttp://www.wikidata.org/prop/direct/P571ᶲhttp://www.wikidata.org/prop/direct/P186ᶲhttp://www.wikidata.org/prop/direct/P18ᶲhttp://www.wikidata.org/prop/direct/P170\" ,   [ \"JOINᶲhttp://www.wikidata.org/prop/direct/P31ᶲhttp://www.wikidata.org/prop/direct/P571ᶲhttp://www.wikidata.org/prop/direct/P186ᶲhttp://www.wikidata.org/prop/direct/P18\" ,     [ \"JOINᶲhttp://www.wikidata.org/prop/direct/P31ᶲhttp://www.wikidata.org/prop/direct/P571ᶲhttp://www.wikidata.org/prop/direct/P186\" ,       [ \"JOINᶲhttp://www.wikidata.org/prop/direct/P31ᶲhttp://www.wikidata.org/prop/direct/P571\" ,         [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\" ] ,         [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P571\" ]       ] ,       [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P186\" ]     ] ,     [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P18\" ]   ] ,   [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P170\" ] ] , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P10\"]] , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P625\"]] , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P276\"]] , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P2048\"]] , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P2049\"]] , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P2067\"]] , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P61\"]] , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P2610\"]] , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P180\"]] , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P2913\"]] , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P195\"]]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_11000++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "4.0\n",
      "-------bgp----------\n",
      "2.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "1\n",
      "-----selects------\n",
      "2\n",
      "------query--------\n",
      "SELECT  ?var1 ?var2 (SAMPLE(?var3) AS ?var4) WHERE   { { SELECT DISTINCT  ?var1 ?var2       WHERE         { ?var2  <http://www.wikidata.org/prop/statement/P735>  <http://www.wikidata.org/entity/Q19826493> .           ?var1  <http://www.wikidata.org/prop/P735>  ?var2         }       LIMIT   101     }     OPTIONAL       { ?var2  ?var3                 ?var5 .         ?var6  <http://wikiba.se/ontology#qualifier>  ?var3       }   } GROUP BY ?var1 ?var2 \n",
      "------trees---------\n",
      "[\"LEFT_JOIN\" , [ \"JOINᶲhttp://www.wikidata.org/prop/statement/P735ᶲhttp://www.wikidata.org/prop/P735\" ,   [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/statement/P735\" ] ,   [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/P735\" ] ] , [ \"JOINᶲhttp://wikiba.se/ontology#qualifier\" ,   [ \"VAR_URI_VARᶲhttp://wikiba.se/ontology#qualifier\" ] ,   [ \"VAR_VAR_VARᶲNONE\" ] ] ]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_11725++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "2.0\n",
      "-------bgp----------\n",
      "2.0\n",
      "------unions---------\n",
      "1\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  (COUNT(DISTINCT ?var1) AS ?var2) WHERE   { {   { ?var1  <http://www.wikidata.org/prop/direct/P17>  <http://www.wikidata.org/entity/Q929> }       UNION         { ?var1  <http://www.wikidata.org/prop/direct/P131>  <http://www.wikidata.org/entity/Q929> }     }   } \n",
      "------trees---------\n",
      "[\"LEFT_JOIN\" , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P17\"] , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P131\"]]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_12008++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "7.0\n",
      "-------bgp----------\n",
      "7.0\n",
      "------unions---------\n",
      "1\n",
      "-----optionals--------\n",
      "4\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT DISTINCT  ?var1 ?var1Label ?var2 ?var3 ?var4 ?var5 ?var6 WHERE   { {   { ?var1  <http://www.wikidata.org/prop/direct/P39>  <http://www.wikidata.org/entity/Q9045502> }       UNION         { ?var1  <http://www.wikidata.org/prop/direct/P39>  <http://www.wikidata.org/entity/Q16159375> }     }     ?var1  <http://www.wikidata.org/prop/direct/P734>  ?var2     OPTIONAL       { ?var2  <http://www.wikidata.org/prop/direct/P31>  ?var3 }     OPTIONAL       { ?var2  <http://www.wikidata.org/prop/direct/P1705>  ?var4 }     OPTIONAL       { ?var2  <http://www.wikidata.org/prop/direct/P282>  ?var5 }     OPTIONAL       { ?var2  <http://www.wikidata.org/prop/direct/P1889>  ?var6 }   } \n",
      "------trees---------\n",
      "[\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"JOIN\", [\"LEFT_JOIN\" , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P39\"] , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P39\"]], [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P734\"]] , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P31\"]] , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P1705\"]] , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P282\"]] , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P1889\"]]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_12345++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "3.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT DISTINCT  ?p2 WHERE   { ?y  <http://www.wikidata.org/prop/direct/P2884>  ?x .     ?z  <http://www.wikidata.org/prop/direct/P2102>  ?x .     ?u  ?p2                   ?x     FILTER ( <http://www.wikidata.org/prop/direct/P2884> != ?p2 )     FILTER ( <http://www.wikidata.org/prop/direct/P2102> != ?p2 )   } \n",
      "------trees---------\n",
      "[ \"JOINᶲhttp://www.wikidata.org/prop/direct/P2884ᶲhttp://www.wikidata.org/prop/direct/P2102\" ,   [ \"JOINᶲhttp://www.wikidata.org/prop/direct/P2884ᶲhttp://www.wikidata.org/prop/direct/P2102\" ,     [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P2884\" ] ,     [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P2102\" ]   ] ,   [ \"VAR_VAR_VARᶲNONE\" ] ] \n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_12664++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "5.0\n",
      "-------bgp----------\n",
      "5.0\n",
      "------unions---------\n",
      "3\n",
      "-----optionals--------\n",
      "1\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "SELECT DISTINCT  ?var1 ?var2 WHERE   {   { ?var1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q2881060> }     UNION       { ?var1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q4117139> }     UNION       { ?var1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q8513> }     UNION       { ?var1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q324254> }     OPTIONAL       { ?var1  <http://www.wikidata.org/prop/direct/P1687>  ?var2 }   } \n",
      "------trees---------\n",
      "[\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\"] , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\"]] , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\"]] , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\"]] , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P1687\"]]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_13456++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "2.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT DISTINCT  ?var1 WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P580>  ?var2 ;            <http://www.wikidata.org/prop/direct/P582>  ?var3     FILTER ( ( ?var2 >= \"654-01-01T00:00:00Z\"^^<http://www.w3.org/2001/XMLSchema#dateTime> ) && ( ?var2 <= \"664-12-31T23:59:59Z\"^^<http://www.w3.org/2001/XMLSchema#dateTime> ) )     FILTER ( ( ?var3 >= \"664-01-01T00:00:00Z\"^^<http://www.w3.org/2001/XMLSchema#dateTime> ) && ( ?var3 <= \"674-12-31T23:59:59Z\"^^<http://www.w3.org/2001/XMLSchema#dateTime> ) )   } \n",
      "------trees---------\n",
      "[\"JOIN\", [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P580\"], [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P582\"]]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_13963++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "3.0\n",
      "-------bgp----------\n",
      "3.0\n",
      "------unions---------\n",
      "1\n",
      "-----optionals--------\n",
      "1\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT ?var1 ?var2Label ?var3 WHERE { { ?var1 <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q571> . } UNION { ?var1 <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q7725634> . } OPTIONAL { ?var1 <http://www.wikidata.org/prop/direct/P212> ?var3 . } }\n",
      "------trees---------\n",
      "[\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\"] , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\"]] , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P212\"]]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_14233++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "6.0\n",
      "-------bgp----------\n",
      "4.0\n",
      "------unions---------\n",
      "4\n",
      "-----optionals--------\n",
      "2\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 ?var2 WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P21>  <http://www.wikidata.org/entity/Q6581072> ;            <http://www.wikidata.org/prop/direct/P106>  <http://www.wikidata.org/entity/Q644687> ;            <http://www.wikidata.org/prop/direct/P19>  ?var2       { ?var2 (<http://www.wikidata.org/prop/direct/P131>)* <http://www.wikidata.org/entity/Q3995> }     UNION       { ?var2 (<http://www.wikidata.org/prop/direct/P131>)* <http://www.wikidata.org/entity/Q4018> }     UNION       { ?var2 (<http://www.wikidata.org/prop/direct/P131>)* <http://www.wikidata.org/entity/Q671023> }     UNION       { ?var2 (<http://www.wikidata.org/prop/direct/P131>)* <http://www.wikidata.org/entity/Q638503> }     UNION       { ?var2 (<http://www.wikidata.org/prop/direct/P131>)* <http://www.wikidata.org/entity/Q673040> }     OPTIONAL       { ?var2  <http://www.wikidata.org/prop/direct/P625>  ?var3 }     OPTIONAL       { ?var1  <http://www.wikidata.org/prop/direct/P18>  ?var4 }     ?var1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q5>   } \n",
      "------trees---------\n",
      "[\"JOIN\", [\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"JOIN\", [ \"JOINᶲhttp://www.wikidata.org/prop/direct/P21ᶲhttp://www.wikidata.org/prop/direct/P106ᶲhttp://www.wikidata.org/prop/direct/P19\" ,   [ \"JOINᶲhttp://www.wikidata.org/prop/direct/P21ᶲhttp://www.wikidata.org/prop/direct/P106\" ,     [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P21\" ] ,     [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P106\" ]   ] ,   [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P19\" ] ] , [\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P131\"] , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P131\"]] , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P131\"]] , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P131\"]] , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P131\"]]] , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P625\"]] , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P18\"]], [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\"]]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_16790++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "3.0\n",
      "-------bgp----------\n",
      "3.0\n",
      "------unions---------\n",
      "1\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  (COUNT(DISTINCT ?var1) AS ?var2) WHERE   { {   { ?var1  <http://www.wikidata.org/prop/direct/P17>  <http://www.wikidata.org/entity/Q20> }       UNION         { ?var1  <http://www.wikidata.org/prop/direct/P131>  <http://www.wikidata.org/entity/Q20> }     }     ?var1  <http://www.wikidata.org/prop/direct/P18>  ?var3   } \n",
      "------trees---------\n",
      "[\"JOIN\", [\"LEFT_JOIN\" , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P17\"] , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P131\"]], [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P18\"]]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_17865++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "2.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P279>  <http://www.wikidata.org/entity/Q18616576> .     ?var2  <http://www.wikidata.org/prop/direct/P279>  ?var2   } \n",
      "------trees---------\n",
      "[ \"JOINᶲhttp://www.wikidata.org/prop/direct/P279ᶲhttp://www.wikidata.org/prop/direct/P279\" ,   [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P279\" ] ,   [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P279\" ] ] \n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_21291++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "14.0\n",
      "-------bgp----------\n",
      "13.0\n",
      "------unions---------\n",
      "5\n",
      "-----optionals--------\n",
      "4\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "SELECT DISTINCT  ?var1 ?var2 ?var3 ?var4 ?var5 (COUNT(DISTINCT ?var6) AS ?var7) WHERE   {   { ?var8  <http://www.wikidata.org/prop/direct/P106>  <http://www.wikidata.org/entity/Q36180> }     UNION       { ?var8  <http://www.wikidata.org/prop/direct/P106>  <http://www.wikidata.org/entity/Q482980> }     UNION       { ?var8  <http://www.wikidata.org/prop/direct/P106>  <http://www.wikidata.org/entity/Q49757> }     ?var8  <http://www.wikidata.org/prop/direct/P27>  ?var9 ;            <http://www.wikidata.org/prop/direct/P268>  ?var3 .     ?var8 ((((<http://www.wikidata.org/prop/direct/P37>|<http://www.wikidata.org/prop/direct/P103>)|<http://www.wikidata.org/prop/direct/P364>)|<http://www.wikidata.org/prop/direct/P407>)|<http://www.wikidata.org/prop/direct/P1412>)|<http://www.wikidata.org/prop/direct/P2439> <http://www.wikidata.org/entity/Q150>       { ?var8  <http://www.wikidata.org/prop/direct/P21>  <http://www.wikidata.org/entity/Q6581072> }     UNION       { ?var8  <http://www.wikidata.org/prop/direct/P21>  <http://www.wikidata.org/entity/Q1097630> }     UNION       { ?var8  <http://www.wikidata.org/prop/direct/P21>  <http://www.wikidata.org/entity/Q1052281> }     UNION       { ?var8  <http://www.wikidata.org/prop/direct/P21>  <http://www.wikidata.org/entity/Q2449503> }     OPTIONAL       { ?var8  <http://www.wikidata.org/prop/direct/P569>  ?var10 }     BIND(year(?var10) AS ?var4)     OPTIONAL       { ?var8  <http://www.wikidata.org/prop/direct/P570>  ?var11 }     BIND(year(?var11) AS ?var5)     ?var6  <http://schema.org/about>  ?var8     OPTIONAL       { ?var8  <http://www.w3.org/2000/01/rdf-schema#label>  ?var1         FILTER ( lang(?var1) = \"fr\" )       }     OPTIONAL       { ?var9  <http://www.w3.org/2000/01/rdf-schema#label>  ?var2         FILTER ( lang(?var2) = \"en\" )       }     FILTER ( ( ?var4 <= 1570 ) && ( ?var5 >= 1539 ) )   } GROUP BY ?var2 ?var1 ?var3 ?var4 ?var5 ORDER BY DESC(?var7) \n",
      "------trees---------\n",
      "[\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"URI_URI_VARᶲhttp://www.wikidata.org/prop/direct/P18\"] , [\"JOIN\", [\"URI_VAR_VARᶲhttp://www.wikidata.org/entity/Q8219\"], [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P18\"]]] , [\"JOIN\", [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P50\"], [\"LEFT_JOIN\" , [ \"JOINᶲhttp://www.wikidata.org/prop/direct/P18ᶲhttp://www.wikidata.org/prop/direct/P921\" ,   [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P18\" ] ,   [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P921\" ] ]  , [ \"JOINᶲhttp://www.wikidata.org/prop/direct/P18ᶲhttp://www.wikidata.org/prop/direct/P50\" ,   [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P18\" ] ,   [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P50\" ] ] ]]]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_22004++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "14.0\n",
      "-------bgp----------\n",
      "13.0\n",
      "------unions---------\n",
      "5\n",
      "-----optionals--------\n",
      "4\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT DISTINCT  ?var1 ?var2 ?var3 ?var4 ?var5 (COUNT(DISTINCT ?var6) AS ?var7) WHERE   {   { ?var8  <http://www.wikidata.org/prop/direct/P106>  <http://www.wikidata.org/entity/Q36180> }     UNION       { ?var8  <http://www.wikidata.org/prop/direct/P106>  <http://www.wikidata.org/entity/Q482980> }     UNION       { ?var8  <http://www.wikidata.org/prop/direct/P106>  <http://www.wikidata.org/entity/Q49757> }     ?var8  <http://www.wikidata.org/prop/direct/P27>  ?var9 ;            <http://www.wikidata.org/prop/direct/P268>  ?var3 .     ?var8 ((((<http://www.wikidata.org/prop/direct/P37>|<http://www.wikidata.org/prop/direct/P103>)|<http://www.wikidata.org/prop/direct/P364>)|<http://www.wikidata.org/prop/direct/P407>)|<http://www.wikidata.org/prop/direct/P1412>)|<http://www.wikidata.org/prop/direct/P2439> <http://www.wikidata.org/entity/Q150>       { ?var8  <http://www.wikidata.org/prop/direct/P21>  <http://www.wikidata.org/entity/Q6581072> }     UNION       { ?var8  <http://www.wikidata.org/prop/direct/P21>  <http://www.wikidata.org/entity/Q1097630> }     UNION       { ?var8  <http://www.wikidata.org/prop/direct/P21>  <http://www.wikidata.org/entity/Q1052281> }     UNION       { ?var8  <http://www.wikidata.org/prop/direct/P21>  <http://www.wikidata.org/entity/Q2449503> }     OPTIONAL       { ?var8  <http://www.wikidata.org/prop/direct/P569>  ?var10 }     BIND(year(?var10) AS ?var4)     OPTIONAL       { ?var8  <http://www.wikidata.org/prop/direct/P570>  ?var11 }     BIND(year(?var11) AS ?var5)     ?var6  <http://schema.org/about>  ?var8     OPTIONAL       { ?var8  <http://www.w3.org/2000/01/rdf-schema#label>  ?var1         FILTER ( lang(?var1) = \"fr\" )       }     OPTIONAL       { ?var9  <http://www.w3.org/2000/01/rdf-schema#label>  ?var2         FILTER ( lang(?var2) = \"en\" )       }     FILTER ( ( ?var4 <= 1570 ) && ( ?var5 >= 1539 ) )   } GROUP BY ?var2 ?var1 ?var3 ?var4 ?var5 ORDER BY DESC(?var7) \n",
      "------trees---------\n",
      "[\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"URI_URI_VARᶲhttp://www.wikidata.org/prop/direct/P18\"] , [\"JOIN\", [\"URI_VAR_VARᶲhttp://www.wikidata.org/entity/Q8219\"], [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P18\"]]] , [\"JOIN\", [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P50\"], [\"LEFT_JOIN\" , [ \"JOINᶲhttp://www.wikidata.org/prop/direct/P18ᶲhttp://www.wikidata.org/prop/direct/P921\" ,   [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P18\" ] ,   [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P921\" ] ]  , [ \"JOINᶲhttp://www.wikidata.org/prop/direct/P18ᶲhttp://www.wikidata.org/prop/direct/P50\" ,   [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P18\" ] ,   [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P50\" ] ] ]]]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_22088++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "14.0\n",
      "-------bgp----------\n",
      "13.0\n",
      "------unions---------\n",
      "5\n",
      "-----optionals--------\n",
      "4\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT DISTINCT  ?var1 ?var2 ?var3 ?var4 ?var5 (COUNT(DISTINCT ?var6) AS ?var7) WHERE   {   { ?var8  <http://www.wikidata.org/prop/direct/P106>  <http://www.wikidata.org/entity/Q36180> }     UNION       { ?var8  <http://www.wikidata.org/prop/direct/P106>  <http://www.wikidata.org/entity/Q482980> }     UNION       { ?var8  <http://www.wikidata.org/prop/direct/P106>  <http://www.wikidata.org/entity/Q49757> }     ?var8  <http://www.wikidata.org/prop/direct/P27>  ?var9 ;            <http://www.wikidata.org/prop/direct/P268>  ?var3 .     ?var8 ((((<http://www.wikidata.org/prop/direct/P37>|<http://www.wikidata.org/prop/direct/P103>)|<http://www.wikidata.org/prop/direct/P364>)|<http://www.wikidata.org/prop/direct/P407>)|<http://www.wikidata.org/prop/direct/P1412>)|<http://www.wikidata.org/prop/direct/P2439> <http://www.wikidata.org/entity/Q150>       { ?var8  <http://www.wikidata.org/prop/direct/P21>  <http://www.wikidata.org/entity/Q6581072> }     UNION       { ?var8  <http://www.wikidata.org/prop/direct/P21>  <http://www.wikidata.org/entity/Q1097630> }     UNION       { ?var8  <http://www.wikidata.org/prop/direct/P21>  <http://www.wikidata.org/entity/Q1052281> }     UNION       { ?var8  <http://www.wikidata.org/prop/direct/P21>  <http://www.wikidata.org/entity/Q2449503> }     OPTIONAL       { ?var8  <http://www.wikidata.org/prop/direct/P569>  ?var10 }     BIND(year(?var10) AS ?var4)     OPTIONAL       { ?var8  <http://www.wikidata.org/prop/direct/P570>  ?var11 }     BIND(year(?var11) AS ?var5)     ?var6  <http://schema.org/about>  ?var8     OPTIONAL       { ?var8  <http://www.w3.org/2000/01/rdf-schema#label>  ?var1         FILTER ( lang(?var1) = \"fr\" )       }     OPTIONAL       { ?var9  <http://www.w3.org/2000/01/rdf-schema#label>  ?var2         FILTER ( lang(?var2) = \"en\" )       }     FILTER ( ( ?var4 <= 1448 ) && ( ?var5 >= 1446 ) )   } GROUP BY ?var2 ?var1 ?var3 ?var4 ?var5 ORDER BY DESC(?var7) \n",
      "------trees---------\n",
      "[\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\"]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+++++++++++++++++++++++++queries2_23391++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "4.0\n",
      "-------bgp----------\n",
      "4.0\n",
      "------unions---------\n",
      "1\n",
      "-----optionals--------\n",
      "1\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 ?var1Label ?var2 WHERE   {   { ?var1  <http://www.wikidata.org/prop/direct/P19>  <http://www.wikidata.org/entity/Q22> }     UNION       { ?var1  <http://www.wikidata.org/prop/direct/P19>  ?var3 .         ?var3 (<http://www.wikidata.org/prop/direct/P131>)* <http://www.wikidata.org/entity/Q22>       }     ?var1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q5>     OPTIONAL       { ?var1  <http://www.wikidata.org/prop/direct/P569>  ?var2 }   } ORDER BY DESC(?var1Label) OFFSET  0 LIMIT   4000 \n",
      "------trees---------\n",
      "[\"LEFT_JOIN\" , [\"JOIN\", [\"LEFT_JOIN\" , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P19\"] , [\"JOIN\", [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P19\"], [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P131\"]]], [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\"]] , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P569\"]]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_24200++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "6.0\n",
      "-------bgp----------\n",
      "4.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "2\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 ?var2Label WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P21>  <http://www.wikidata.org/entity/Q6581072> ;            <http://www.wikidata.org/prop/direct/P106>  <http://www.wikidata.org/entity/Q644687> ;            <http://www.wikidata.org/prop/direct/P19>  ?var3 .     ?var3 (<http://www.wikidata.org/prop/direct/P131>)* <http://www.wikidata.org/entity/Q3995>     OPTIONAL       { ?var3  <http://www.wikidata.org/prop/direct/P625>  ?var4 }     OPTIONAL       { ?var1  <http://www.wikidata.org/prop/direct/P18>  ?var5 }     ?var1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q5>   } \n",
      "------trees---------\n",
      "[\"JOIN\", [\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"JOIN\", [ \"JOINᶲhttp://www.wikidata.org/prop/direct/P21ᶲhttp://www.wikidata.org/prop/direct/P106ᶲhttp://www.wikidata.org/prop/direct/P19\" ,   [ \"JOINᶲhttp://www.wikidata.org/prop/direct/P21ᶲhttp://www.wikidata.org/prop/direct/P106\" ,     [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P21\" ] ,     [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P106\" ]   ] ,   [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P19\" ] ] , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P131\"]] , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P625\"]] , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P18\"]], [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\"]]\n"
     ]
    }
   ],
   "source": [
    "lst = [0, 22, 275, 457, 556, 666, 766, 800, 998, 1248, 2303, 3222, 3599, 4732, 5095, 5429, 6985, 7788, 8358, 8830, 8930, 8932, 9568, 10757, 10969, 11000, 11725, 12008, 12345, 12664, 13456, 13963, 14233, 16790, 17865, 21291, 22004, 22088, 23391, 24200]\n",
    "p_lst(lst)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[30, 87, 444, 459, 961, 1335, 1956, 2106, 2119, 2710, 10553, 12015, 18985, 25068, 25797]\n",
      "+++++++++++++++++++++++TOTAL+++++++++++++++++++++++++\n",
      "15\n",
      "\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_30++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "1.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 ?var1Label WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P698>  11520265 } \n",
      "------trees---------\n",
      "[\"VAR_URI_LITERALᶲhttp://www.wikidata.org/prop/direct/P698\"]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_87++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "1.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  * WHERE   { ?var1  <http://www.w3.org/1999/02/22-rdf-syntax-ns#label>  \"string1\"@en } \n",
      "------trees---------\n",
      "[\"VAR_URI_LITERALᶲhttp://www.w3.org/1999/02/22-rdf-syntax-ns#label\"]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_444++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "3.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 WHERE   { ?var1  <http://www.w3.org/2006/03/wn/wn20/schema/containsWordSense>  ?var2 .     ?var2  <http://www.w3.org/2006/03/wn/wn20/schema/word>  ?var3 .     ?var3  <http://www.w3.org/2006/03/wn/wn20/schema/lexicalForm>  \"bank\"@en-US   } \n",
      "------trees---------\n",
      "[ \"JOINᶲhttp://www.w3.org/2006/03/wn/wn20/schema/containsWordSenseᶲhttp://www.w3.org/2006/03/wn/wn20/schema/wordᶲhttp://www.w3.org/2006/03/wn/wn20/schema/lexicalForm\" ,   [ \"JOINᶲhttp://www.w3.org/2006/03/wn/wn20/schema/containsWordSenseᶲhttp://www.w3.org/2006/03/wn/wn20/schema/word\" ,     [ \"VAR_URI_VARᶲhttp://www.w3.org/2006/03/wn/wn20/schema/containsWordSense\" ] ,     [ \"VAR_URI_VARᶲhttp://www.w3.org/2006/03/wn/wn20/schema/word\" ]   ] ,   [ \"VAR_URI_LITERALᶲhttp://www.w3.org/2006/03/wn/wn20/schema/lexicalForm\" ] ] \n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_459++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "6.0\n",
      "-------bgp----------\n",
      "3.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "1\n",
      "-----selects------\n",
      "2\n",
      "------query--------\n",
      "SELECT  ?var1 (COUNT(?var2) AS ?var3) WHERE   { { SELECT DISTINCT  ?var1       WHERE         { ?var4  <http://www.wikidata.org/prop/P39>  _:b0 .           _:b0   <http://www.wikidata.org/prop/statement/P39>  <http://www.wikidata.org/entity/Q19367406> .           _:b0 <http://www.wikidata.org/prop/qualifier/P580>|<http://www.wikidata.org/prop/qualifier/P582> ?var1         }     }     ?var2  <http://www.wikidata.org/prop/P39>  ?var5 .     ?var5  <http://www.wikidata.org/prop/statement/P39>  <http://www.wikidata.org/entity/Q19367406> ;            <http://www.wikidata.org/prop/qualifier/P580>  ?var6     FILTER ( ?var6 < ?var1 )     OPTIONAL       { ?var5  <http://www.wikidata.org/prop/qualifier/P582>  ?var7 }     FILTER ( ( ! bound(?var7) ) || ( ?var7 >= ?var1 ) )   } GROUP BY ?var1 ORDER BY ASC(?var1) \n",
      "------trees---------\n",
      "[\"VAR_URI_LITERALᶲhttp://www.wikidata.org/prop/direct/P3107\"]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_961++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "0.0\n",
      "-------bgp----------\n",
      "0.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT DISTINCT  ?var1 WHERE   { BIND(<http://www.wikidata.org/entity/Q30127559> AS ?var2)     ?var2 ((((<http://www.wikidata.org/prop/direct/P30>|<http://www.wikidata.org/prop/direct/P17>)|<http://www.wikidata.org/prop/direct/P131>)|<http://www.wikidata.org/prop/direct/P376>)|<http://www.wikidata.org/prop/direct/P501>)* ?var1   } \n",
      "------trees---------\n",
      "[\"VAR_URI_LITERALᶲhttp://www.wikidata.org/prop/direct/P3107\"]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_1335++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "1.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT DISTINCT  ?var1 WHERE   { { ?var1  <http://www.wikidata.org/prop/direct/P585>  2012 } } \n",
      "------trees---------\n",
      "[\"VAR_URI_LITERALᶲhttp://www.wikidata.org/prop/direct/P585\"]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_1956++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "1.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 WHERE   { ?var1  ?var2  \"%pizza%\"@en-US } LIMIT   10 \n",
      "------trees---------\n",
      "[\"VAR_VAR_LITERALᶲNONE\"]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_2106++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "0.0\n",
      "-------bgp----------\n",
      "0.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT DISTINCT  ?var1 WHERE   { BIND(<http://www.wikidata.org/entity/Q31942090> AS ?var2)     ?var2 ((((<http://www.wikidata.org/prop/direct/P30>|<http://www.wikidata.org/prop/direct/P17>)|<http://www.wikidata.org/prop/direct/P131>)|<http://www.wikidata.org/prop/direct/P376>)|<http://www.wikidata.org/prop/direct/P501>)* ?var1   } \n",
      "------trees---------\n",
      "[\"VAR_VAR_LITERALᶲNONE\"]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_2119++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "1.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  * WHERE   { ?var1  <http://schema.org/description>  \"ភាសាខ្មែរ\"@km } \n",
      "------trees---------\n",
      "[\"VAR_URI_LITERALᶲhttp://schema.org/description\"]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_2710++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "7.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT DISTINCT  ?var1 WHERE   { ?var2  <http://www.wikidata.org/prop/qualifier/value/P580>  ?var3 ;            <http://www.wikidata.org/prop/qualifier/value/P582>  ?var4 .     ?var3  <http://wikiba.se/ontology#timePrecision>  11 ;            <http://wikiba.se/ontology#timeValue>  ?var5 .     ?var4  <http://wikiba.se/ontology#timePrecision>  11 ;            <http://wikiba.se/ontology#timeValue>  ?var6     FILTER ( ?var6 < ?var5 )     ?var1  ?var7  ?var2   } \n",
      "------trees---------\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[\"JOIN\", [ \"JOINᶲhttp://www.wikidata.org/prop/qualifier/value/P580ᶲhttp://www.wikidata.org/prop/qualifier/value/P582ᶲhttp://wikiba.se/ontology#timeValueᶲhttp://wikiba.se/ontology#timeValueᶲhttp://wikiba.se/ontology#timePrecisionᶲhttp://wikiba.se/ontology#timePrecision\" ,   [ \"JOINᶲhttp://www.wikidata.org/prop/qualifier/value/P580ᶲhttp://www.wikidata.org/prop/qualifier/value/P582ᶲhttp://wikiba.se/ontology#timeValueᶲhttp://wikiba.se/ontology#timeValueᶲhttp://wikiba.se/ontology#timePrecision\" ,     [ \"JOINᶲhttp://www.wikidata.org/prop/qualifier/value/P580ᶲhttp://www.wikidata.org/prop/qualifier/value/P582ᶲhttp://wikiba.se/ontology#timeValueᶲhttp://wikiba.se/ontology#timeValue\" ,       [ \"JOINᶲhttp://www.wikidata.org/prop/qualifier/value/P580ᶲhttp://www.wikidata.org/prop/qualifier/value/P582ᶲhttp://wikiba.se/ontology#timeValue\" ,         [ \"JOINᶲhttp://www.wikidata.org/prop/qualifier/value/P580ᶲhttp://www.wikidata.org/prop/qualifier/value/P582\" ,           [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/qualifier/value/P580\" ] ,           [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/qualifier/value/P582\" ]         ] ,         [ \"VAR_URI_VARᶲhttp://wikiba.se/ontology#timeValue\" ]       ] ,       [ \"VAR_URI_VARᶲhttp://wikiba.se/ontology#timeValue\" ]     ] ,     [ \"VAR_URI_LITERALᶲhttp://wikiba.se/ontology#timePrecision\" ]   ] ,   [ \"VAR_URI_LITERALᶲhttp://wikiba.se/ontology#timePrecision\" ] ] , [\"VAR_VAR_VARᶲNONE\"]]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_10553++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "1.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  * WHERE   { ?var1  ?var2  \"Тубероза\"@ru } LIMIT   100 \n",
      "------trees---------\n",
      "[\"VAR_VAR_LITERALᶲNONE\"]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_12015++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "2.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  * WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q4167410> ;            <http://schema.org/description>  \"ན་མ\"@bo   } \n",
      "------trees---------\n",
      "[ \"JOINᶲhttp://www.wikidata.org/prop/direct/P31ᶲhttp://schema.org/description\" ,   [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\" ] ,   [ \"VAR_URI_LITERALᶲhttp://schema.org/description\" ] ] \n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_18985++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "2.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  * WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q4167410> ;            <http://schema.org/description>  \"Вікіпэдыя\"@be-tarask   } \n",
      "------trees---------\n",
      "[ \"JOINᶲhttp://www.wikidata.org/prop/direct/P31ᶲhttp://schema.org/description\" ,   [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\" ] ,   [ \"VAR_URI_LITERALᶲhttp://schema.org/description\" ] ] \n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_25068++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "6.0\n",
      "-------bgp----------\n",
      "5.0\n",
      "------unions---------\n",
      "1\n",
      "-----optionals--------\n",
      "1\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P21>  <http://www.wikidata.org/entity/Q6581072>       { ?var1  <http://www.wikidata.org/prop/direct/P19>  <http://www.wikidata.org/entity/Q29> }     UNION       { ?var1  <http://www.wikidata.org/prop/direct/P19>  ?var2 .         ?var2 (<http://www.wikidata.org/prop/direct/P131>)* <http://www.wikidata.org/entity/Q29>       }     OPTIONAL       { ?var3  <http://schema.org/about>  ?var1 ;                <http://schema.org/inLanguage>  \"es\"       }     FILTER ( ! bound(?var3) )     ?var1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q5>   } LIMIT   1000 \n",
      "------trees---------\n",
      "[\"JOIN\", [\"LEFT_JOIN\" , [\"JOIN\", [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P21\"], [\"LEFT_JOIN\" , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P19\"] , [\"JOIN\", [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P19\"], [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P131\"]]]] , [ \"JOINᶲhttp://schema.org/inLanguageᶲhttp://schema.org/about\" ,   [ \"VAR_URI_LITERALᶲhttp://schema.org/inLanguage\" ] ,   [ \"VAR_URI_VARᶲhttp://schema.org/about\" ] ] ], [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\"]]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_25797++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "3.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 (COUNT(?var2) AS ?var3) WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q5> ;            <http://www.wikidata.org/prop/direct/P734>  \"Angela\" ;            <http://www.wikidata.org/prop/direct/P735>  \"Merkel\"   } GROUP BY ?var1 ORDER BY DESC(?var3) LIMIT   10 \n",
      "------trees---------\n",
      "[ \"JOINᶲhttp://www.wikidata.org/prop/direct/P31ᶲhttp://www.wikidata.org/prop/direct/P734ᶲhttp://www.wikidata.org/prop/direct/P735\" ,   [ \"JOINᶲhttp://www.wikidata.org/prop/direct/P31ᶲhttp://www.wikidata.org/prop/direct/P734\" ,     [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\" ] ,     [ \"VAR_URI_LITERALᶲhttp://www.wikidata.org/prop/direct/P734\" ]   ] ,   [ \"VAR_URI_LITERALᶲhttp://www.wikidata.org/prop/direct/P735\" ] ] \n"
     ]
    }
   ],
   "source": [
    "lst2 = sorted([25797,25068,30,459,961,1335,2710,2106,87,444,1956,2119,10553,18985,12015])\n",
    "print(lst2)\n",
    "p_lst(lst2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[486, 929, 3570, 4878, 7428, 8811, 9691, 10874, 12036, 12245, 12463, 13248, 16640, 25390, 25515]\n",
      "+++++++++++++++++++++++TOTAL+++++++++++++++++++++++++\n",
      "15\n",
      "\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_486++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "0.0\n",
      "-------bgp----------\n",
      "0.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT DISTINCT  ?var1 WHERE   { BIND(<http://www.wikidata.org/entity/Q12501> AS ?var2)     ?var2 ((((<http://www.wikidata.org/prop/direct/P30>|<http://www.wikidata.org/prop/direct/P17>)|<http://www.wikidata.org/prop/direct/P131>)|<http://www.wikidata.org/prop/direct/P376>)|<http://www.wikidata.org/prop/direct/P501>)* ?var1   } \n",
      "------trees---------\n",
      "[\"URI_VAR_VARᶲhttp://www.wikidata.org/entity/Q18557119\"]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_929++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "2.0\n",
      "-------bgp----------\n",
      "2.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 ?var2 WHERE   { <http://it.dbpedia.org/resource/Villa_Pignatelli>               <http://www.w3.org/2002/07/owl#sameAs>  ?var2 .     ?var2 <http://www.wikidata.org/prop/direct/P31>/(<http://www.wikidata.org/prop/direct/P279>)* <http://www.wikidata.org/entity/Q33506> .     ?var2  <http://www.wikidata.org/prop/direct/P2003>  ?var1   } \n",
      "------trees---------\n",
      "[\"JOIN\", [\"URI_URI_VARᶲhttp://www.w3.org/2002/07/owl#sameAs\"], [\"JOIN\", [\"JOIN\", [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P279\"], [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P31\"]], [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P2003\"]]]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_3570++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "2.0\n",
      "-------bgp----------\n",
      "2.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 ?var2 WHERE   { <http://it.dbpedia.org/resource/Teatro_romano_di_Spoleto>               <http://www.w3.org/2002/07/owl#sameAs>  ?var2 .     ?var2 <http://www.wikidata.org/prop/direct/P31>/(<http://www.wikidata.org/prop/direct/P279>)* <http://www.wikidata.org/entity/Q33506> .     ?var2  <http://www.wikidata.org/prop/direct/P2003>  ?var1   } \n",
      "------trees---------\n",
      "[\"JOIN\", [\"URI_URI_VARᶲhttp://www.w3.org/2002/07/owl#sameAs\"], [\"JOIN\", [\"JOIN\", [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P279\"], [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P31\"]], [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P2003\"]]]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_4878++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "1.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "1\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 ?var2 WHERE   { VALUES ?var3 { <http://www.wikidata.org/entity/Q14952> }     ?var1 (<http://www.wikidata.org/prop/direct/P279>)* ?var3     OPTIONAL       { ?var1  <http://www.wikidata.org/prop/direct/P279>  ?var2 }   } \n",
      "------trees---------\n",
      "[\"LEFT_JOIN\" , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P279\"] , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P279\"]]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_7428++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "1.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "1\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 ?var2 WHERE   { VALUES ?var3 { <http://www.wikidata.org/entity/Q1043939> }     ?var1 (<http://www.wikidata.org/prop/direct/P279>)* ?var3     OPTIONAL       { ?var1  <http://www.wikidata.org/prop/direct/P279>  ?var2 }   } \n",
      "------trees---------\n",
      "[\"LEFT_JOIN\" , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P279\"] , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P279\"]]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_8811++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "1.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "1\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 ?var2 WHERE   { VALUES ?var3 { <http://www.wikidata.org/entity/Q30570183> }     ?var1 (<http://www.wikidata.org/prop/direct/P31>)* ?var3     OPTIONAL       { ?var1  <http://www.wikidata.org/prop/direct/P31>  ?var2 }   } \n",
      "------trees---------\n",
      "[\"LEFT_JOIN\" , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P31\"] , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P31\"]]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_9691++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "0.0\n",
      "-------bgp----------\n",
      "0.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT DISTINCT  ?var1 WHERE   { BIND(<http://www.wikidata.org/entity/Q1001513> AS ?var2)     ?var2 ((((<http://www.wikidata.org/prop/direct/P30>|<http://www.wikidata.org/prop/direct/P17>)|<http://www.wikidata.org/prop/direct/P131>)|<http://www.wikidata.org/prop/direct/P376>)|<http://www.wikidata.org/prop/direct/P501>)* ?var1   } \n",
      "------trees---------\n",
      "[ \"JOINᶲhttp://www.wikidata.org/prop/direct/P703ᶲhttp://www.wikidata.org/prop/direct/P352\" ,   [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P703\" ] ,   [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P352\" ] ] \n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_10874++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "2.0\n",
      "-------bgp----------\n",
      "2.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 ?var2 WHERE   { <http://it.dbpedia.org/resource/Museo_nazionale_di_San_Matteo>               <http://www.w3.org/2002/07/owl#sameAs>  ?var2 .     ?var2 <http://www.wikidata.org/prop/direct/P31>/(<http://www.wikidata.org/prop/direct/P279>)* <http://www.wikidata.org/entity/Q33506> .     ?var2  <http://www.wikidata.org/prop/direct/P2003>  ?var1   } \n",
      "------trees---------\n",
      "[\"JOIN\", [\"URI_URI_VARᶲhttp://www.w3.org/2002/07/owl#sameAs\"], [\"JOIN\", [\"JOIN\", [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P279\"], [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P31\"]], [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P2003\"]]]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_12036++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "4.0\n",
      "-------bgp----------\n",
      "2.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "1\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT DISTINCT  * WHERE   { ?var1 <http://www.wikidata.org/prop/direct/P279>/(<http://www.wikidata.org/prop/direct/P279>)* <http://www.wikidata.org/entity/Q56061> .     ?var1  <http://www.wikidata.org/prop/direct/P279>  <http://www.wikidata.org/entity/Q10864048> ;            <http://www.wikidata.org/prop/direct/P17>  ?var2 .     ?var2  <http://www.wikidata.org/prop/direct/P297>  \"DE\"     OPTIONAL       { ?var1  <http://www.wikidata.org/prop/direct/P360>  ?var3 }   } ORDER BY ASC(lcase(?var3)) \n",
      "------trees---------\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[\"LEFT_JOIN\" , [\"JOIN\", [\"JOIN\", [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P279\"], [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P279\"]], [ \"JOINᶲhttp://www.wikidata.org/prop/direct/P279ᶲhttp://www.wikidata.org/prop/direct/P17ᶲhttp://www.wikidata.org/prop/direct/P297\" ,   [ \"JOINᶲhttp://www.wikidata.org/prop/direct/P279ᶲhttp://www.wikidata.org/prop/direct/P17\" ,     [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P279\" ] ,     [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P17\" ]   ] ,   [ \"VAR_URI_LITERALᶲhttp://www.wikidata.org/prop/direct/P297\" ] ] ] , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P360\"]]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_12245++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "1.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "1\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 ?var2 WHERE   { VALUES ?var3 { <http://www.wikidata.org/entity/Q1370598> }     ?var1 (<http://www.wikidata.org/prop/direct/P279>)* ?var3     OPTIONAL       { ?var1  <http://www.wikidata.org/prop/direct/P279>  ?var2 }   } \n",
      "------trees---------\n",
      "[\"LEFT_JOIN\" , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P279\"] , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P279\"]]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_12463++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "0.0\n",
      "-------bgp----------\n",
      "0.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT DISTINCT  ?var1 WHERE   { BIND(<http://www.wikidata.org/entity/Q68787> AS ?var2)     ?var2 ((((<http://www.wikidata.org/prop/direct/P30>|<http://www.wikidata.org/prop/direct/P17>)|<http://www.wikidata.org/prop/direct/P131>)|<http://www.wikidata.org/prop/direct/P376>)|<http://www.wikidata.org/prop/direct/P501>)* ?var1   } \n",
      "------trees---------\n",
      "[ \"JOINᶲhttp://www.wikidata.org/prop/direct/P31ᶲhttp://www.wikidata.org/prop/direct/P1082\" ,   [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\" ] ,   [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P1082\" ] ] \n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_13248++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "1.0\n",
      "-------bgp----------\n",
      "1.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "1\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 ?var2 WHERE   { VALUES ?var3 { <http://www.wikidata.org/entity/Q386724> }     ?var1 (<http://www.wikidata.org/prop/direct/P279>)* ?var3     OPTIONAL       { ?var1  <http://www.wikidata.org/prop/direct/P279>  ?var2 }   } \n",
      "------trees---------\n",
      "[\"LEFT_JOIN\" , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P279\"] , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P279\"]]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_16640++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "0.0\n",
      "-------bgp----------\n",
      "0.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 WHERE   { ?var1 <http://www.wikidata.org/prop/direct/P31>/(<http://www.wikidata.org/prop/direct/P279>)* <http://www.wikidata.org/entity/Q5341295> } \n",
      "------trees---------\n",
      "[\"JOIN\", [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P279\"], [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P31\"]]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_25390++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "6.0\n",
      "-------bgp----------\n",
      "4.0\n",
      "------unions---------\n",
      "4\n",
      "-----optionals--------\n",
      "2\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  ?var1 WHERE   { ?var1  <http://www.wikidata.org/prop/direct/P21>  <http://www.wikidata.org/entity/Q6581072> ;            <http://www.wikidata.org/prop/direct/P106>  <http://www.wikidata.org/entity/Q644687> ;            <http://www.wikidata.org/prop/direct/P19>  ?var2       { ?var2 (<http://www.wikidata.org/prop/direct/P131>)* <http://www.wikidata.org/entity/Q3995> }     UNION       { ?var2 (<http://www.wikidata.org/prop/direct/P131>)* <http://www.wikidata.org/entity/Q4018> }     UNION       { ?var2 (<http://www.wikidata.org/prop/direct/P131>)* <http://www.wikidata.org/entity/Q671023> }     UNION       { ?var2 (<http://www.wikidata.org/prop/direct/P131>)* <http://www.wikidata.org/entity/Q638503> }     UNION       { ?var2 (<http://www.wikidata.org/prop/direct/P131>)* <http://www.wikidata.org/entity/Q673040> }     OPTIONAL       { ?var2  <http://www.wikidata.org/prop/direct/P625>  ?var3 }     OPTIONAL       { ?var1  <http://www.wikidata.org/prop/direct/P18>  ?var4 }     ?var1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q5>   } \n",
      "------trees---------\n",
      "[\"JOIN\", [\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"JOIN\", [ \"JOINᶲhttp://www.wikidata.org/prop/direct/P21ᶲhttp://www.wikidata.org/prop/direct/P106ᶲhttp://www.wikidata.org/prop/direct/P19\" ,   [ \"JOINᶲhttp://www.wikidata.org/prop/direct/P21ᶲhttp://www.wikidata.org/prop/direct/P106\" ,     [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P21\" ] ,     [ \"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P106\" ]   ] ,   [ \"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P19\" ] ] , [\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"LEFT_JOIN\" , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P131\"] , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P131\"]] , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P131\"]] , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P131\"]] , [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P131\"]]] , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P625\"]] , [\"VAR_URI_VARᶲhttp://www.wikidata.org/prop/direct/P18\"]], [\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P31\"]]\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "+++++++++++++++++++++++++queries2_25515++++++++++++++++++++++++++++++++++++++\n",
      "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n",
      "-------triple-------\n",
      "0.0\n",
      "-------bgp----------\n",
      "0.0\n",
      "------unions---------\n",
      "0\n",
      "-----optionals--------\n",
      "0\n",
      "-----selects------\n",
      "1\n",
      "------query--------\n",
      "SELECT  (COUNT(?var1) AS ?var2) WHERE   { ?var1 (<http://www.wikidata.org/prop/direct/P279>)* <http://www.wikidata.org/entity/Q223557> } \n",
      "------trees---------\n",
      "[\"VAR_URI_URIᶲhttp://www.wikidata.org/prop/direct/P279\"]\n"
     ]
    }
   ],
   "source": [
    "lst3 = [486, 929, 3570, 4878, 7428, 8811, 9691, 10874, 12036, 12245, 12463, 13248, 16640, 25390, 25515]\n",
    "print(lst3)\n",
    "p_lst(lst3)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
